{
    "basics": {
        "name": "Gonzalo Nicolas Fernández",
        "label": "Desarrollador backend con 3 años de experiencia en creación de APIs y optimización de sistemas con Node.js y TypeScript. Despliegue en la nube con Docker y AWS, enfocado en soluciones eficientes y mantenibles. Adaptable a nuevas tecnologías y colaborador eficaz en equipos ágiles",
        "image": "/me.webp",
        "email": "fernandez-gonza@hotmail.com",
        "url": "https://gonzalofernandez.netlify.app/",
        "location": {
            "address": "Belgrano 173",
            "postalCode": "7521",
            "city": "San Cayetano",
            "countryCode": "Ar",
            "region": "Argentina"
        },
        "profiles": [
            {
                "network": "LinkedIn",
                "username": "Gonzalo Fernández",
                "url": "https://www.linkedin.com/in/gonzalo-nicolas-fernandez"
            },
            {
                "network": "GitHub",
                "username": "Gonzalo",
                "url": "https://github.com/CharlyGon"
            }
        ]
    },
    "work": [
        {
            "company": "Simple AI",
            "location": "Argentina - En remoto",
            "roles": [
                {
                    "position": "Backend Developer",
                    "startDate": "2024-11-01",
                    "endDate": "",
                    "title": "Automatización de Procesos Operativos",
                    "summary": [
                        "Desarrollo backend para optimizar procesos operativos en una empresa que integra inteligencia artificial y experiencia humana.",
                        "Automatización de flujos con Puppeteer y Playwright, reduciendo errores y tiempos operativos.",
                        "Implementación de funciones serverless en AWS Lambda con Node.js para una infraestructura escalable."
                    ],
                    "technologies": "Node.js, TypeScript, AWS Lambda, Puppeteer, Playwright, Scrum, GitHub"
                }
            ]
        },
        {
            "company": "Dam Squad",
            "location": "España - En remoto",
            "roles": [
                {
                    "position": "Backend Developer",
                    "startDate": "2024-05-01",
                    "endDate": "2024-10-01",
                    "title": "Versionador de Documentos",
                    "summary": [
                        "Desarrollo de backend para una plataforma de gestión de usuarios con roles diferenciados y autenticación sin contraseña.",
                        "Integración de Stripe para pagos y configuración de notificaciones automáticas por correo.",
                        "Implementación de un sistema de intercambio de documentos categorizados, con avance automático de hitos según el tipo de documento subido.",
                        "Colaboración en un entorno ágil (Scrum) asegurando entregas regulares."
                    ],
                    "technologies": "Node.js, TypeScript, Prisma, PostgreSQL, Stripe, Zod, Express.js, Scrum, GitLab"
                }
            ]
        },
        {
            "company": "Blue Bit Software",
            "location": "Argentina - En remoto",
            "roles": [
                {
                    "position": "Backend Developer",
                    "startDate": "2021-09-01",
                    "endDate": "2024-04-01",
                    "title": "Versionador de Documentos",
                    "summary": [
                        "Desarrollo de un sistema de versionado de documentos que permitía a los usuarios regresar a versiones anteriores y publicar nuevas versiones con firma digital y gestión de roles de usuario.",
                        "Implementación de almacenamiento en AWS S3 para guardar imágenes vinculadas a documentos y claves privadas de los usuarios, gestionadas mediante AWS KMS para garantizar la seguridad en la firma digital.",
                        "Responsable de despliegues manuales en AWS (ECR, EC2), gestionando la infraestructura y el correcto funcionamiento de los contenedores.",
                        "Redacción de documentación técnica detallada, fundamental para los usuarios finales y la operación del sistema."
                    ],
                    "technologies": "Node.js, TypeScript, Mongoose, MongoDB, Docker, Makefile, AWS ECR, AWS EC2, AWS S3, AWS KMS, Postman, Git, GitHub, Scrum"
                },
                {
                    "position": "Backend Developer",
                    "startDate": "2023-03-01",
                    "endDate": "2023-08-01",
                    "title": "Plataforma de Intercambio de Assets Virtuales",
                    "summary": [
                        "Desarrollo del backend para una plataforma orientada al intercambio de assets virtuales, específicamente diseñada para influencers.",
                        "Despliegue y automatización de contratos inteligentes, permitiendo la interacción directa con la blockchain para gestionar transacciones de assets.",
                        "Responsable del despliegue y mantenimiento de la infraestructura en AWS, asegurando la escalabilidad y el correcto funcionamiento de los servicios.",
                        "Interacción con diversas blockchains para la integración y operación de los contratos inteligentes."
                    ],
                    "technologies": "Nest.js, Node.js, TypeScript, Solidity, JavaScript, Web3, MySQL, Docker, Makefile, AWS ECR, AWS EC2, Ethereum, Solana, Git, GitLab, Scrum"
                },
                {
                    "position": "Software Developer",
                    "startDate": "2022-02-01",
                    "endDate": "2022-06-01",
                    "title": "Proxy Sin Interfaz Gráfica",
                    "summary": [
                        "Desarrollo de un proxy sin interfaz gráfica, diseñado para superar restricciones geográficas y mantener el anonimato en las conexiones.",
                        "Implementación de scripts y automatizaciones que permitían asignar dinámicamente nuevas direcciones IP, reutilizando servicios restringidos por ubicación geográfica.",
                        "Configuración y gestión de infraestructura en la nube para garantizar la estabilidad y el rendimiento del proxy.",
                        "Adaptación continua del sistema a las necesidades del proyecto mediante el uso de automatización avanzada para la asignación de IPs."
                    ],
                    "technologies": "AWS Lambda, AWS EC2, AWS ECR, AWS CloudWatch, Bash, Python, Git, GitHub, Scrum"
                },
                {
                    "position": "Frontend Developer",
                    "startDate": "2020-09-01",
                    "endDate": "2021-08-01",
                    "title": "Página de Inicio de la Empresa",
                    "summary": [
                        "Responsable del desarrollo y diseño de la página de inicio de la empresa utilizando React, CSS y Material-UI, siguiendo maquetas predefinidas para asegurar una interfaz visualmente atractiva y funcional.",
                        "Implementación de virtualización de aplicaciones mediante Docker, optimizando el entorno de desarrollo y despliegue.",
                        "Gestión eficiente de repositorios en GitHub y despliegue de la aplicación en AWS, garantizando un flujo de trabajo continuo y estable."
                    ],
                    "technologies": "React, Docker, AWS ECR, AWS EC2, CSS, GitHub"
                }
            ]
        }
    ],
    "education": [
        {
            "institution": "Instituto Superior Santo Domingo",
            "url": "https://issd.edu.ar/es/analista-sistemas/",
            "area": "Analista de Sistemas",
            "studyType": "Terciario",
            "startDate": "01-01-2020",
            "endDate": null
        }
    ],
    "skills": [
        {
            "category": "Lenguajes y Frameworks",
            "items": [
                "Node.js",
                "TypeScript",
                "React",
                "Nest.js",
                "Express.js"
            ]
        },
        {
            "category": "Bases de Datos - ODMs/ORMs",
            "items": [
                "PostgreSQL",
                "MongoDB",
                "MySQL",
                "Mongoose (ODM)",
                "Prisma (ORM)"
            ]
        },
        {
            "category": "Infraestructura",
            "items": [
                "AWS (EC2, S3, Lambda, ECR, CloudWatch)",
                "Docker"
            ]
        },
        {
            "category": "Blockchain",
            "items": [
                "Solidity",
                "Web3.js",
                "Ethereum",
                "Solana",
                "Polygon"
            ]
        },
        {
            "category": "Otras Herramientas",
            "items": [
                "Zod",
                "Bash",
                "Postman",
                "Stripe API"
            ]
        },
        {
            "category": "Testing",
            "items": [
                "Jest",
                "Pruebas unitarias",
                "Pruebas de integración",
                "TDD (Test-Driven Development)"
            ]
        },
        {
            "category": "Metodologías",
            "items": [
                "Scrum",
                "Agile"
            ]
        }
    ],
    "languages": [
        {
            "language": "Spanish",
            "fluency": "Native speaker"
        },
        {
            "language": "English",
            "fluency": "Advanced"
        }
    ]
}